fullDevelopedBoundaryCondition/testCase/0.orig/U_fd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
8192
(
(0.00807909 0.00807909 -0.0149683)
(0.0240034 0.0136206 -0.0214838)
(0.0386571 0.0168275 -0.0204704)
(0.0449295 0.0202531 -0.0194102)
(0.0435746 0.023516 -0.0187047)
(0.0358483 0.0262215 -0.0182594)
(0.0234239 0.0281338 -0.0180033)
(0.00812711 0.0291202 -0.017887)
...
)
;

boundaryField
{
    fixedWalls
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
