fullDevelopedBoundaryCondition/testCase/Allrun
#!/bin/bash

blockMesh > log.blockMesh
ofTutorial3
