fullDevelopedBoundaryCondition/testCase/system/cellZoneDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      cellZoneDict;
}
/*---------------------------------------------------------------------------*/

readTime        "20";

fieldName       Uy;

cellZoneName     
(
    // allZone
    cellZoneTest1                  
    cellZoneTest2
    cellZoneTest3
    // cellSetTest1
    // cellSetTest2
);

// hello
// {
//     name        shenhui.ruan;
//     age         "26";
//     gender      male;

// }


